src/cf/src/Documents/КоммерческоеПредложение/КоммерческоеПредложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КоммерческоеПредложение</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКоммерческихПредложений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <predefined>
    <items>
      <name>Закупочная</name>
      <description>Prix d'achat</description>
    </items>
    <items>
      <name>Розничная</name>
      <description>Prix de vente</description>
    </items>
    <items>
      <name>МинимальнаяЦенаПродажи</name>
      <description>Prix minimal</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическийРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсноваРасчёта</name>
    <type>
      <types>EnumRef.ОсновыРасчётаНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНаценки</name>
    <type>
      <types>EnumRef.ВидыНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Documents/КоммерческоеПредложение/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ВалютаДоИзменения; // валюта и курс, от которых пересчитываются цены при смене валюты
&НаКлиенте
Перем КурсДоИзменения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтотОбъект);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтотОбъект);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтотОбъект, Объект);
	КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подменю", Элементы.ТЧТовары.КоманднаяПанель);
	Если Не ТолькоПросмотр Тогда
		КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подбор", Элементы.ТЧТовары.КоманднаяПанель);
	КонецЕсли;
	Элементы.ФормаСоздатьЗаказНаПроизводство.Видимость = ПолучитьФункциональнуюОпцию("Производство");
	Если Объект.Ссылка.Пустая() И Не Объект.ВВалюте Тогда
		Объект.Валюта = РаботаСВалютами.ОсновнаяВалюта();
		Объект.КурсВалюты = 1;
		ЗаполнитьВалютуПоДоговору();
	КонецЕсли;
	УстановитьВидимостьВалюты();
	// Копия документа в валюте - курс на её дату, а не исходного документа.
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) И Объект.ВВалюте Тогда
		ЗаполнитьКурсНаДату();
		РаботаСВалютамиКлиентСервер.ПересчитатьСуммыРегл(Объект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОписаниеСтроки();
	ЗапомнитьВалюту();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Количество") Тогда
		ЧислоСтрок = Объект.ТЧТовары.Количество();
		РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоПодбору(Объект, ВыбранноеЗначение, , Неопределено, ЭтотОбъект);
		// Описание по умолчанию - только у добавленной строки: подбор в существующую строку описание не трогает.
		ТекущаяСтрока = Элементы.ТЧТовары.ТекущиеДанные;
		Если Объект.ТЧТовары.Количество() > ЧислоСтрок И ТекущаяСтрока <> Неопределено Тогда
			ТекущаяСтрока.Описание = ОписаниеСтрокиПоУмолчанию(ТекущаяСтрока.Номенклатура);
		КонецЕсли;
		ОбновитьОписаниеСтроки();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СохранитьОписаниеТекущейСтроки();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтотОбъект, ТекущийОбъект);
	УстановитьВидимостьВалюты();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	Для Каждого СтрокаТовара Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(СтрокаТовара, Объект.ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ЗаполнитьДанныеПоТорговойТочке(Объект, ВидЦены, Элементы.ТЧТоварыВидЦены);
	УстановитьВидЦеныПоДоговору();
	ВалютаПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Истина);
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Объект.Менеджер = РаботаСДокументамиВызовСервера.ПолучитьКуратораДоговора(Объект.Договор, Объект.Дата).Менеджер;
	УстановитьВидЦеныПоДоговору();
	ВалютаПоДоговору();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧТовары

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущаяСтрока = Элемент.ТекущиеДанные;
		ТекущаяСтрока.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
		ТекущаяСтрока.ВидЦены = ВидЦены;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриАктивизацииЯчейки(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриАктивизацииСтроки(Элемент)
	ОбновитьОписаниеСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеСтрокиПриИзменении(Элемент)
	СохранитьОписаниеТекущейСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ТЧТовары.ТекущиеДанные;
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(ТекущаяСтрока, Объект);
	ТекущаяСтрока.Описание = ОписаниеСтрокиПоУмолчанию(ТекущаяСтрока.Номенклатура);
	ОбновитьОписаниеСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ВидЦены = ВидЦены;
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект,
		СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные,
		ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыВидЦеныПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьЦенуНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПроцентСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаСкидкиПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСкидкаНаЦенуПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерезаполнитьЦены(Команда)
	УстановитьЦеныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказКлиента(Команда)
	СоздатьЗаказПоПредложению(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказНаПроизводство(Команда)
	СоздатьЗаказПоПредложению(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбщуюКоманду(Команда)
	КомандыТабличныхЧастейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаСервере
Процедура УстановитьЦеныНаСервере()
	ВалютаДокумента = Новый Структура("Валюта, Курс", ?(Объект.ВВалюте, Объект.Валюта, Неопределено),
		РаботаСВалютамиКлиентСервер.КурсДокумента(Объект));
	РаботаСДокументами.УстановитьЦеныВТабличнойЧасти(Объект.ТЧТовары, ВидЦены, Объект.Дата,
		Объект.ЦенаВключаетНДС, Объект.Контрагент, ВалютаДокумента);
	РаботаСВалютамиКлиентСервер.ПересчитатьСуммыРегл(Объект);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидЦеныПоДоговору()
	ВидЦены = ?(ЗначениеЗаполнено(Объект.Контрагент.ТипЦены), Объект.Контрагент.ТипЦены, Справочники.ВидыЦен.Розничная);
	РаботаСДокументамиКлиентСервер.ЗаполнитьСписокВыбораВидовЦен(ВидЦены, Элементы.ТЧТоварыВидЦены);
	Объект.ЦенаВключаетНДС = ОбщегоНазначенияВызовСервера.ЦенаВключаетНДСПоВидуЦен(ВидЦены);
КонецПроцедуры

// Заказ клиента на основании предложения - продажа, заказ на производство - с видом операции «Производство»
// и материалами по техкартам; больше заказы ничем не различаются. Несохранённое предложение записывается.
//
// Параметры:
//  НаПроизводство - Булево - создать заказ клиента на производство
//
&НаКлиенте
Процедура СоздатьЗаказПоПредложению(НаПроизводство)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		Если Не Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Основание = Новый Структура("Предложение, НаПроизводство", Объект.Ссылка, НаПроизводство);
	ПараметрыФормы = Новый Структура("Основание", Основание);
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияЗаказа", ЭтотОбъект);
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект, , , , Оповещение);
КонецПроцедуры

// Записанный заказ переводит предложение в статус «Выигран»: форма перечитывает документ, если его не правили.
//
// Параметры:
//  Результат               - Произвольный - результат закрытия формы заказа.
//  ДополнительныеПараметры - Неопределено - не используются.
//
&НаКлиенте
Процедура ПослеЗакрытияЗаказа(Результат, ДополнительныеПараметры) Экспорт
	Если Не Модифицированность Тогда
		Прочитать();
		ОбновитьОписаниеСтроки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОписаниеСтроки()
	ТекущаяСтрока = Элементы.ТЧТовары.ТекущиеДанные;
	ОписаниеСтроки = ?(ТекущаяСтрока = Неопределено, "", ТекущаяСтрока.Описание);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОписаниеСтрокиПоУмолчанию(Знач Номенклатура)
	Возврат Документы.КоммерческоеПредложение.ОписаниеСтрокиПоУмолчанию(Номенклатура);
КонецФункции

&НаКлиенте
Процедура СохранитьОписаниеТекущейСтроки()
	ТекущаяСтрока = Элементы.ТЧТовары.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.Описание = ОписаниеСтроки;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	КурсПоДатеДокумента();
КонецПроцедуры

// Документ в валюте (docs/plans/multicurrency.md): флажок ВВалюте открывает валюту и курс, цены и суммы строк -
// в валюте документа, колонка СуммаРегл - в основной валюте.

&НаКлиенте
Процедура ВВалютеПриИзменении(Элемент)
	ПрежняяВалюта = Объект.Валюта;
	ПрежнийКурс = Объект.КурсВалюты;
	ВВалютеПриИзмененииНаСервере();
	ПослеСменыВалюты(ПрежняяВалюта, ПрежнийКурс);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
	ПослеСменыВалюты(ВалютаДоИзменения, КурсДоИзменения);
КонецПроцедуры

&НаКлиенте
Процедура КурсВалютыПриИзменении(Элемент)
	// Цены остаются в валюте документа - меняются только суммы в основной валюте.
	ПослеСменыВалюты(Объект.Валюта, Объект.КурсВалюты);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПересчитатьСуммуРеглСтроки(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуРеглСтроки(Стр)
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Стр.СуммаРегл = РаботаСВалютамиКлиентСервер.СуммаРегл(Стр.Сумма, РаботаСВалютамиКлиентСервер.КурсДокумента(Объект));
КонецПроцедуры

// Запоминает валюту и курс, от которых пересчитываются цены при следующей смене валюты.
//
&НаКлиенте
Процедура ЗапомнитьВалюту()
	ВалютаДоИзменения = Объект.Валюта;
	КурсДоИзменения = Объект.КурсВалюты;
КонецПроцедуры

// После смены валюты, курса или флажка: суммы в основной валюте и, если сменилась сама валюта, - вопрос
// о пересчёте цен строк из прежней валюты в новую.
//
// Параметры:
//  ПрежняяВалюта - СправочникСсылка.Валюты - валюта до изменения.
//  ПрежнийКурс - Число - курс до изменения.
//
&НаКлиенте
Процедура ПослеСменыВалюты(ПрежняяВалюта, ПрежнийКурс)
	РаботаСВалютамиКлиентСервер.ПересчитатьСуммыРегл(Объект);
	ЕстьСтроки = Объект.ТЧТовары.Количество() > 0;
	Если ПрежняяВалюта = Объект.Валюта Или Не ЕстьСтроки Или ПрежнийКурс <= 0 Тогда
		ЗапомнитьВалюту();
		Возврат;
	КонецЕсли;
	Текст = СтрШаблон(НСтр("ru = 'Пересчитать цены строк из %1 в %2 по курсу?';
		|fr = 'Convertir les prix des lignes de %1 en %2 au taux de change ?';
		|en = 'Convert line prices from %1 to %2 at the exchange rate?';
		|es = '¿Convertir los precios de las líneas de %1 a %2 al tipo de cambio?'"), ПрежняяВалюта, Объект.Валюта);
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОПересчетеЦен", ЭтотОбъект, ПрежнийКурс);
	ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПересчетеЦен(Ответ, ПрежнийКурс) Экспорт
	ЗапомнитьВалюту();
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	// Курсы - к основной валюте (для основной 1), поэтому цена в новой валюте = цена × прежний курс / новый курс.
	Коэффициент = ПрежнийКурс / РаботаСВалютамиКлиентСервер.КурсДокумента(Объект);
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Стр.Цена = Стр.Цена * Коэффициент;
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС, "Цена");
	КонецЦикла;
	РаботаСВалютамиКлиентСервер.ПересчитатьСуммыРегл(Объект);
	Модифицированность = Истина;
КонецПроцедуры

// Договор в валюте переводит документ в эту валюту; при смене валюты - вопрос о пересчёте цен.
//
&НаКлиенте
Процедура ВалютаПоДоговору()
	ЗаполнитьВалютуПоДоговору();
	ПослеСменыВалюты(ВалютаДоИзменения, КурсДоИзменения);
КонецПроцедуры

// Курс на новую дату документа.
//
&НаКлиенте
Процедура КурсПоДатеДокумента()
	Если Не Объект.ВВалюте Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьКурсНаДатуНаСервере();
	ПослеСменыВалюты(Объект.Валюта, Объект.КурсВалюты);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКурсНаДатуНаСервере()
	ЗаполнитьКурсНаДату();
КонецПроцедуры

&НаСервере
Процедура ВВалютеПриИзмененииНаСервере()
	Если Объект.ВВалюте Тогда
		ЗаполнитьКурсНаДату();
	Иначе
		Объект.Валюта = РаботаСВалютами.ОсновнаяВалюта();
		Объект.КурсВалюты = 1;
	КонецЕсли;
	УстановитьВидимостьВалюты();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	ЗаполнитьКурсНаДату();
	УстановитьВидимостьВалюты();
КонецПроцедуры

// Курс валюты документа на его дату из регистра КурсыВалют; курс не задан - нулевой курс и сообщение:
// документ без курса не запишется (РаботаСВалютами.ПроверитьВалютуДокумента), пока курс не введут вручную.
//
&НаСервере
Процедура ЗаполнитьКурсНаДату()
	Если Не Объект.ВВалюте Тогда
		Возврат;
	КонецЕсли;
	Курс = РаботаСВалютами.КурсВалюты(Объект.Валюта, Объект.Дата);
	Объект.КурсВалюты = Курс;
	Если Курс > 0 Тогда
		Возврат;
	КонецЕсли;
	Шаблон = НСтр("ru = 'Курс валюты %1 на %2 не задан (Казначейство - Курсы валют): укажите курс в документе.';
		|fr = 'Le taux de change de %1 au %2 n''est pas défini (Trésorerie - Taux de change) : indiquez le taux dans le document.';
		|en = 'The %1 exchange rate on %2 is not set (Treasury - Exchange rates): enter the rate in the document.';
		|es = 'El tipo de cambio de %1 al %2 no está definido (Tesorería - Tipos de cambio): indique el tipo en el documento.'");
	ТекстСообщения = СтрШаблон(Шаблон, Объект.Валюта, Формат(Объект.Дата, "ДЛФ=D"));
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.КурсВалюты");
КонецПроцедуры

// Договор в валюте, отличной от основной, переводит документ в эту валюту.
//
&НаСервере
Процедура ЗаполнитьВалютуПоДоговору()
	// Документ с заполненными строками (ввод на основании, копирование) валюту не меняет: цены строк
	// остались бы в прежней валюте.
	Если Объект.ТЧТовары.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	ВалютаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ВалютаВзаиморасчётов");
	Если Не ЗначениеЗаполнено(ВалютаДоговора) Или ВалютаДоговора = РаботаСВалютами.ОсновнаяВалюта()
		Или ВалютаДоговора = Объект.Валюта Тогда
		Возврат;
	КонецЕсли;
	Объект.ВВалюте = Истина;
	Объект.Валюта = ВалютаДоговора;
	ЗаполнитьКурсНаДату();
	УстановитьВидимостьВалюты();
КонецПроцедуры

// Доступность валюты и курса, заголовки цен и сумм с валютой, колонка сумм в основной валюте.
//
&НаСервере
Процедура УстановитьВидимостьВалюты()
	ВВалюте = Объект.ВВалюте;
	Элементы.Валюта.Доступность = ВВалюте;
	Элементы.КурсВалюты.Доступность = ВВалюте;
	Элементы.ТЧТоварыСуммаРегл.Видимость = ВВалюте;
	ТекстЦена = НСтр("ru = 'Цена'; fr = 'Prix'; en = 'Price'; es = 'Precio'");
	ТекстСумма = НСтр("ru = 'Сумма'; fr = 'Montant'; en = 'Amount'; es = 'Importe'");
	Если ВВалюте Тогда
		ЗаголовокЦена = РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстЦена, Объект.Валюта);
		ЗаголовокСумма = РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстСумма, Объект.Валюта);
	Иначе
		// Пустой заголовок - заголовок по реквизиту.
		ЗаголовокЦена = "";
		ЗаголовокСумма = "";
	КонецЕсли;
	ЗаголовокСуммаРегл = РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстСумма, РаботаСВалютами.ОсновнаяВалюта());
	Элементы.ТЧТоварыЦена.Заголовок = ЗаголовокЦена;
	Элементы.ТЧТоварыСумма.Заголовок = ЗаголовокСумма;
	Элементы.ТЧТоварыСуммаРегл.Заголовок = ЗаголовокСуммаРегл;
КонецПроцедуры

#КонецОбласти
